Updated some diagrams
